CsBoBoNice/dzxh_STM32f10x_lib/dzxh_stm32_catch.c
    TIM_ClearITPendingBit(TIM3, TIM_IT_CC1|TIM_IT_CC2|TIM_IT_CC3|TIM_IT_CC4|TIM_IT_Update); //清除中断标志位
}
#endif /* TIM3_IRQHandler_ENABLE */

#ifdef TIM4_IRQHandler_ENABLE
void TIM4_IRQHandler(void)
{
	if((TIM4CH1_CAPTURE_STA&0X80)==0)//还未成功捕获	
	{	  
		if (TIM_GetITStatus(TIM4, TIM_IT_Update) != RESET)	//TIM_IT_Update TIM 中断源
		 
		{	    
			if(TIM4CH1_CAPTURE_STA&0X40)//已经捕获到低电平了
			{
				if((TIM4CH1_CAPTURE_STA&0X3F)==0X3F)//低电平太长了
				{
					TIM4CH1_CAPTURE_STA|=0X80;//标记成功捕获了一次
					TIM4CH1_CAPTURE_VAL=0XFFFF;
				}else TIM4CH1_CAPTURE_STA++;
			}	 
		}
		if (TIM_GetITStatus(TIM4, TIM_IT_CC1) != RESET)//捕获1发生捕获事件	检查指定的 TIM 中断发生与否
		{	
			if(TIM4CH1_CAPTURE_STA&0X40)		//捕获到一个上升沿 		
			{	  			
				TIM4CH1_CAPTURE_STA|=0X80;		//标记成功捕获到一次低电平脉宽
				TIM4CH1_CAPTURE_VAL=TIM_GetCapture1(TIM4);//获得 TIMx 输入捕获 1 的值
		   		TIM_OC1PolarityConfig(TIM4,TIM_ICPolarity_Falling); //CC1P=0 设置为下降沿捕获
																	//设置 TIMx 通道 1 极性
			}else  								//还未开始,第一次捕获上升沿
			{
				TIM4CH1_CAPTURE_STA=0;			//清空
				TIM4CH1_CAPTURE_VAL=0;
	 			TIM_SetCounter(TIM4,0);//设置 TIMx 计数器寄存器值
				TIM4CH1_CAPTURE_STA|=0X40;		//标记捕获到了上升沿
		   		TIM_OC1PolarityConfig(TIM4,TIM_ICPolarity_Rising);		//CC1P=1 设置为上升沿捕获
															/*TIM_ICPolarity_Rising TIM 输入捕获上升沿
																TIM_ICPolarity_Falling TIM 输入捕获下降沿			
															*/
			}		    
		}			     	    					   
 	}

	if((TIM4CH2_CAPTURE_STA&0X80)==0)//还未成功捕获	
	{	  
		if (TIM_GetITStatus(TIM4, TIM_IT_Update) != RESET)	//TIM_IT_Update TIM 中断源
		 
		{	    
			if(TIM4CH2_CAPTURE_STA&0X40)//已经捕获到低电平了
			{
				if((TIM4CH2_CAPTURE_STA&0X3F)==0X3F)//低电平太长了
				{
					TIM4CH2_CAPTURE_STA|=0X80;//标记成功捕获了一次
					TIM4CH2_CAPTURE_VAL=0XFFFF;
				}else TIM4CH2_CAPTURE_STA++;
			}	 
		}
		if (TIM_GetITStatus(TIM4, TIM_IT_CC2) != RESET)//捕获2发生捕获事件	检查指定的 TIM 中断发生与否
		{	
			if(TIM4CH2_CAPTURE_STA&0X40)		//捕获到一个上升沿 		
			{	  			
				TIM4CH2_CAPTURE_STA|=0X80;		//标记成功捕获到一次低电平脉宽
				TIM4CH2_CAPTURE_VAL=TIM_GetCapture2(TIM4);//获得 TIMx 输入捕获 2 的值
		   		TIM_OC2PolarityConfig(TIM4,TIM_ICPolarity_Falling); //CC2P=0 设置为下降沿捕获
																	//设置 TIMx 通道 2 极性
			}else  								//还未开始,第一次捕获上升沿
			{
				TIM4CH2_CAPTURE_STA=0;			//清空
				TIM4CH2_CAPTURE_VAL=0;
	 			TIM_SetCounter(TIM4,0);//设置 TIMx 计数器寄存器值
				TIM4CH2_CAPTURE_STA|=0X40;		//标记捕获到了上升沿
		   		TIM_OC2PolarityConfig(TIM4,TIM_ICPolarity_Rising);		//CC2P=1 设置为上升沿捕获
															/*TIM_ICPolarity_Rising TIM 输入捕获上升沿
																TIM_ICPolarity_Falling TIM 输入捕获下降沿			
															*/
			}		    
		}			     	    					   
 	}

	if((TIM4CH3_CAPTURE_STA&0X80)==0)//还未成功捕获	
	{	  
		if (TIM_GetITStatus(TIM4, TIM_IT_Update) != RESET)	//TIM_IT_Update TIM 中断源
		 
		{	    
			if(TIM4CH3_CAPTURE_STA&0X40)//已经捕获到低电平了
			{
				if((TIM4CH3_CAPTURE_STA&0X3F)==0X3F)//低电平太长了
				{
					TIM4CH3_CAPTURE_STA|=0X80;//标记成功捕获了一次
					TIM4CH3_CAPTURE_VAL=0XFFFF;
				}else TIM4CH3_CAPTURE_STA++;
			}	 
		}
		if (TIM_GetITStatus(TIM4, TIM_IT_CC3) != RESET)//捕获3发生捕获事件	检查指定的 TIM 中断发生与否
		{	
			if(TIM4CH3_CAPTURE_STA&0X40)		//捕获到一个上升沿 		
			{	  			
				TIM4CH3_CAPTURE_STA|=0X80;		//标记成功捕获到一次低电平脉宽
				TIM4CH3_CAPTURE_VAL=TIM_GetCapture3(TIM4);//获得 TIMx 输入捕获 3 的值
		   		TIM_OC3PolarityConfig(TIM4,TIM_ICPolarity_Falling); //CC3P=0 设置为下降沿捕获
																	//设置 TIMx 通道 3 极性
			}else  								//还未开始,第一次捕获上升沿
			{
				TIM4CH3_CAPTURE_STA=0;			//清空
				TIM4CH3_CAPTURE_VAL=0;
	 			TIM_SetCounter(TIM4,0);//设置 TIMx 计数器寄存器值
				TIM4CH3_CAPTURE_STA|=0X40;		//标记捕获到了上升沿
		   		TIM_OC3PolarityConfig(TIM4,TIM_ICPolarity_Rising);		//CC3P=1 设置为上升沿捕获
															/*TIM_ICPolarity_Rising TIM 输入捕获上升沿
																TIM_ICPolarity_Falling TIM 输入捕获下降沿			
															*/
			}		    
		}			     	    					   
 	}

	if((TIM4CH4_CAPTURE_STA&0X80)==0)//还未成功捕获	
	{	  
		if (TIM_GetITStatus(TIM4, TIM_IT_Update) != RESET)	//TIM_IT_Update TIM 中断源
		 
		{	    
			if(TIM4CH4_CAPTURE_STA&0X40)//已经捕获到低电平了
			{
				if((TIM4CH4_CAPTURE_STA&0X3F)==0X3F)//低电平太长了
				{
					TIM4CH4_CAPTURE_STA|=0X80;//标记成功捕获了一次
					TIM4CH4_CAPTURE_VAL=0XFFFF;
				}else TIM4CH4_CAPTURE_STA++;
			}	 
		}
		if (TIM_GetITStatus(TIM4, TIM_IT_CC4) != RESET)//捕获4发生捕获事件	检查指定的 TIM 中断发生与否
		{	
			if(TIM4CH4_CAPTURE_STA&0X40)		//捕获到一个上升沿 		
			{	  			
				TIM4CH4_CAPTURE_STA|=0X80;		//标记成功捕获到一次低电平脉宽
				TIM4CH4_CAPTURE_VAL=TIM_GetCapture4(TIM4);//获得 TIMx 输入捕获 4 的值
		   		TIM_OC4PolarityConfig(TIM4,TIM_ICPolarity_Falling); //CC4P=0 设置为下降沿捕获
																	//设置 TIMx 通道 4 极性
			}else  								//还未开始,第一次捕获上升沿
			{
				TIM4CH4_CAPTURE_STA=0;			//清空
				TIM4CH4_CAPTURE_VAL=0;
	 			TIM_SetCounter(TIM4,0);//设置 TIMx 计数器寄存器值
				TIM4CH4_CAPTURE_STA|=0X40;		//标记捕获到了上升沿
		   		TIM_OC4PolarityConfig(TIM4,TIM_ICPolarity_Rising);		//CC4P=1 设置为上升沿捕获
															/*TIM_ICPolarity_Rising TIM 输入捕获上升沿
																TIM_ICPolarity_Falling TIM 输入捕获下降沿			
															*/
			}		    
		}			     	    					   
 	}

    TIM_ClearITPendingBit(TIM4, TIM_IT_CC1|TIM_IT_CC2|TIM_IT_CC3|TIM_IT_CC4|TIM_IT_Update); //清除中断标志位
}
#endif /* TIM4_IRQHandler_ENABLE */

#ifdef TIM5_IRQHandler_ENABLE
void TIM5_IRQHandler(void)
{
	if((TIM5CH1_CAPTURE_STA&0X80)==0)//还未成功捕获	
	{	  
		if (TIM_GetITStatus(TIM5, TIM_IT_Update) != RESET)	//TIM_IT_Update TIM 中断源
		 
		{	    
			if(TIM5CH1_CAPTURE_STA&0X40)//已经捕获到低电平了
			{
				if((TIM5CH1_CAPTURE_STA&0X3F)==0X3F)//低电平太长了
				{
					TIM5CH1_CAPTURE_STA|=0X80;//标记成功捕获了一次
					TIM5CH1_CAPTURE_VAL=0XFFFF;
				}else TIM5CH1_CAPTURE_STA++;
			}	 
		}
		if (TIM_GetITStatus(TIM5, TIM_IT_CC1) != RESET)//捕获1发生捕获事件	检查指定的 TIM 中断发生与否
		{	
			if(TIM5CH1_CAPTURE_STA&0X40)		//捕获到一个上升沿 		
			{	  			
				TIM5CH1_CAPTURE_STA|=0X80;		//标记成功捕获到一次低电平脉宽
				TIM5CH1_CAPTURE_VAL=TIM_GetCapture1(TIM5);//获得 TIMx 输入捕获 1 的值
		   		TIM_OC1PolarityConfig(TIM5,TIM_ICPolarity_Falling); //CC1P=0 设置为下降沿捕获
																	//设置 TIMx 通道 1 极性
			}else  								//还未开始,第一次捕获上升沿
			{
				TIM5CH1_CAPTURE_STA=0;			//清空
				TIM5CH1_CAPTURE_VAL=0;
	 			TIM_SetCounter(TIM5,0);//设置 TIMx 计数器寄存器值
				TIM5CH1_CAPTURE_STA|=0X40;		//标记捕获到了上升沿
		   		TIM_OC1PolarityConfig(TIM5,TIM_ICPolarity_Rising);		//CC1P=1 设置为上升沿捕获
															/*TIM_ICPolarity_Rising TIM 输入捕获上升沿
																TIM_ICPolarity_Falling TIM 输入捕获下降沿			
															*/
			}		    
		}			     	    					   
 	}

	if((TIM5CH2_CAPTURE_STA&0X80)==0)//还未成功捕获	
	{	  
		if (TIM_GetITStatus(TIM5, TIM_IT_Update) != RESET)	//TIM_IT_Update TIM 中断源
		 
		{	    
			if(TIM5CH2_CAPTURE_STA&0X40)//已经捕获到低电平了
			{
				if((TIM5CH2_CAPTURE_STA&0X3F)==0X3F)//低电平太长了
				{
					TIM5CH2_CAPTURE_STA|=0X80;//标记成功捕获了一次
					TIM5CH2_CAPTURE_VAL=0XFFFF;
				}else TIM5CH2_CAPTURE_STA++;
			}	 
		}
		if (TIM_GetITStatus(TIM5, TIM_IT_CC2) != RESET)//捕获2发生捕获事件	检查指定的 TIM 中断发生与否
		{	
			if(TIM5CH2_CAPTURE_STA&0X40)		//捕获到一个上升沿 		
			{	  			
				TIM5CH2_CAPTURE_STA|=0X80;		//标记成功捕获到一次低电平脉宽
				TIM5CH2_CAPTURE_VAL=TIM_GetCapture2(TIM5);//获得 TIMx 输入捕获 2 的值
		   		TIM_OC2PolarityConfig(TIM5,TIM_ICPolarity_Falling); //CC2P=0 设置为下降沿捕获
																	//设置 TIMx 通道 2 极性
			}else  								//还未开始,第一次捕获上升沿
			{
				TIM5CH2_CAPTURE_STA=0;			//清空
				TIM5CH2_CAPTURE_VAL=0;
	 			TIM_SetCounter(TIM5,0);//设置 TIMx 计数器寄存器值
				TIM5CH2_CAPTURE_STA|=0X40;		//标记捕获到了上升沿
		   		TIM_OC2PolarityConfig(TIM5,TIM_ICPolarity_Rising);		//CC2P=1 设置为上升沿捕获
															/*TIM_ICPolarity_Rising TIM 输入捕获上升沿
																TIM_ICPolarity_Falling TIM 输入捕获下降沿			
															*/
			}		    
		}			     	    					   
 	}

